Repository: sv-cover/cover-php
Catalog: locale/*/LC_MESSAGES/cover-web.po
Languages: nl_nl

source: What is the colour of grass? (I am not a robot)
nl_nl: Wat is de kleur van gras? (ik ben geen spam-bot)

source: If you are unsure, just enter ‘green’.
nl_nl: Als je het niet zeker weet, vul dan 'groen' in.

source: Your confirmation link is no longer valid. Your account has probably already been activated.
nl_nl: Deze bevestingslink is niet (meer) geldig. Waarschijnlijk is je account al geactiveerd.

source: By now you should have received a long and informative email about Cover, and at the bottom of that email there is a link to set your password. If you can't find the email, you can <a href="%s">reset your password</a>.
nl_nl: Als het goed is heb je een introductiemail gekregen met onderaan een link om een wachtwoord in te stellen. Mocht je de mail niet kunnen vinden, dan kan je je <a href="%s">wachtwoord resetten</a>.

source: Pending registrations
nl_nl: Hangende aanmeldingen

source: Registered on
nl_nl: Aangemeld op

source: Confirmation link
nl_nl: Bevestigingslink

source: Edit pending registrations
nl_nl: Bewerk hangende aanmelding

source: Back
nl_nl: Terug

source: Your membership application has been submitted. If everything goes according to plan, you should have an email with a confirmation code by now.
nl_nl: Je lidmaatschapsaanvraag is verstuurd. Als het goed is heb je inmiddels een mailtje met een bevestigingscode.

source: Archives of %s
nl_nl: Archief van %s

source: Mailing lists
nl_nl: Mailinglijsten

source: Archived messages
nl_nl: Archief

source: Sender
nl_nl: Afzender

source: Message from the archive of %s, processed on %s (return code %s)
nl_nl: Bericht uit Archief van %s, verwerkt op %s (return-code %s)

source: Change emai
nl_nl: Wijzig e-mail

source: Return to mailing list
nl_nl: Terug naar mailinglijst

source: Sign in to subscribe to this mailing list.
nl_nl: Log in om je aan te kunnen melden voor deze mailinglijst.

source: You are subscribed to this mailinglist.
nl_nl: Je bent aangemeld voor deze mailinglijst.

source: Modify mailing list
nl_nl: Wijzig mailinglijst

source: New mailing list
nl_nl: Mailinglijst toevoegen

source: List email address
nl_nl: Lijstadres

source: e.g. listname@svcover.nl
nl_nl: e.g. lijstnaam@svcover.nl

source: What type of list is this?
nl_nl: Op basis waarvan wordt de lijst gevuld?

source: Access
nl_nl: Toegang

source: Who can send emails to this list?
nl_nl: Wie mag e-mails sturen naar deze lijst?

source: Which committee may subscribe and unsubscribe people to this list?
nl_nl: Welke commissie mag bepalen wie er op de lijst staat?

source: People can subscribe themselves to this list.
nl_nl: Mensen mogen zichzelf aanmelden voor deze lijst.

source: Automatic emails
nl_nl: Automatische e-mails

source: This mailing list sends everyone who is added or adds theirselves an email automatically.
nl_nl: Deze lijst stuurt iedereen die zichzelf aanmeldt automatisch een mailtje.

source: Configure a message to send automatically when someone is subscribed to this list.
nl_nl: Stel bericht in dat automatisch wordt verstuurd bij aanmelding.

source: This mailing list sends an automatic response on your first email to this mailing list when you are not a member of the list.
nl_nl: Deze lijst stuurt automatisch een reactie wanneer je er voor de eerste keer naar toe mailt en niet op de lijst bent ingeschreven.

source: Configure an automatic response on the first message someone sends to the mailing list (while not a member of said list).
nl_nl: Stel een automatische eerste reactie in die wordt verstuurd wanneer iemand mailt naar de mailinglijst.

source: Add list
nl_nl: Maak lijst

source: Owner
nl_nl: Eigenaar

source: Activity
nl_nl: Activiteit

source: Reach
nl_nl: Bereik

source: None of you committees is managing any mailing lists.
nl_nl: Geen van jouw commissies beheert een mailinglijst.

source: Your committee is not managing any mailing lists.
nl_nl: Jouw commissie beheert geen mailinglijst.

source: If you need one, ask the AC/DCee to make one for you.
nl_nl: Als je er een nodig hebt, kan je de AC/DCee vragen er een voor je te maken.

source: Modify mailing list properties
nl_nl: Bewerk mailinglijsteigenschappen

source: Add member
nl_nl: Lid toevoegen

source: Subscribe a non-member
nl_nl: Niet-lid toevoegen

source: Unsubscribe selected
nl_nl: Meld geselecteerde adressen af

source: Age
nl_nl: Leeftijd

source: Subscribe a member
nl_nl: Lid abonneren

source: Subscribe
nl_nl: Meld aan

source: Member id(s)
nl_nl: Lidnummer(s)

source: Unsubscribe from %s
nl_nl: Uitschrijven %s

source: You are no longer subscribed to the <em>%s</em> mailing list.
nl_nl: Je staat niet langer op de lijst <em>%s</em>.

source: You are about to unsubscribe from the <em>%s</em> mailing list. Are you sure you want to continue?
nl_nl: Je staat je op het punt uit te schrijven uit de mailinglijst <em>%s</em>. Weet je dit zeker?

source: Unsubscribe me
nl_nl: Schrijf mij uit

source: No, I was just curious
nl_nl: Nee, ik was gewoon nieuwsgierig

source: Choose photo
nl_nl: Kies nieuwe foto

source: Finished! Your email address has been confirmed and updated!
nl_nl: Klaar! Je e-mailadres is bevestigd en bijgewerkt!

source: Oh dear, this link is no longer valid.
nl_nl: Oh jee! Deze link is niet meer geldig.

source: It might be the case that you’ve already confirmed your email address. Try to log in with your new address. It that doesn’t work, try to use your previous address once again. Did you forget your password? You might want to try both your previous and current email address when asking for password recovery.
nl_nl: Het kan goed zijn dat je je e-mailadres al eerder bevestigd hebt. Probeer in te loggen met je nieuwe e-mailadres. Mocht dat niet lukken, probeer het dan toch weer eens met je vorige adres. Klopt het wachtwoord niet? Probeer dan beide e-mailadressen wanneer je een nieuw wachtwoord aanvraagt.

source: Still having trouble? Send an email to %s and we’ll help you.
nl_nl: Kom je er niet uit? Mail dan naar %s zodat we je verder kunnen helpen.

source: Back to the homepage
nl_nl: Terug naar de website

source: Signed and active since %s.
nl_nl: Getekend en actief sinds %s.

source: Your fifteen most recent direct debits.
nl_nl: Je laatste vijftien incasso's.

source: To be debited
nl_nl: Nog te incasseren

source: Price
nl_nl: Prijs

source: Debit batch %d
nl_nl: Incassobatch %d

source: Sorry, Incass-o-matic cannot be reached at this moment.
nl_nl: Sorry, Incass-o-matic is niet bereikbaar op het moment.

source: You do not yet have a continuous direct debit contract.
nl_nl: Je hebt nog geen doorlopend incassocontract.

source: With a continuous direct debit contract, you no longer have to print and sign direct debit forms. No more going to the printer after buying new credits in KAST!
nl_nl: Met een doorlopend incassocontract hoef je niet meer zelf incasso's te printen en te ondertekenen. Dus nooit meer naar de printer lopen nadat je in KAST kruisjes hebt gekocht!

source: Download the contract, sign it, and hand it to the treasurer, %s, or deliver it to the mailbox in the Cover room.
nl_nl: Download het contract, onderteken het, en lever het in bij de penningmeester, %s, of laat het achter in het postvakje in de Coverkamer.

source: As soon as your contract has been processed, you can view your direct debits here every moment of the day. Both freshly created direct debit transactions as well as already debited ones will be displayed here.
nl_nl: Zodra het contract verwerkt is kan je hier op ieder moment de incasso's hier inzien, zowel de incasso's die net zijn aangemaakt als de incasso's die al zijn afgeschreven.

source: Credit balanse
nl_nl: Kredietbalans

source: %d credit
nl_nl: %d kruisje

source: Your ten most recent purchases are listed here.
nl_nl: Je tien meest recente aankopen staan hier genoemd.

source: Product
nl_nl: Produkt

source: Date of purchase
nl_nl: Datum van aankoop

source: Our apologies, we can't fetch the KAST purchase history at this moment.
nl_nl: Sorry, je KAST aankoophistorie kon op het moment niet worden opgehaald.

source: Unsubscribe
nl_nl: Uitschrijven

source: Personal data
nl_nl: Almanakgegevens

source: Save
nl_nl: Opslaan

source: Privacy settings
nl_nl: Privacy instellingen

source: Modify your privacy preferences to indicate who can see what info.
nl_nl: Je privacy instellingen geven aan wie welke informatie mag zien.

source: Nobody
nl_nl: Niemand

source: Everyone
nl_nl: Iedereen

source: Webinformation
nl_nl: Webgegevens

source: Your profile details are used to make you (un)recognizable on the forum.
nl_nl: Je webgegevens worden gebruikt om je er een beetje (on)herkenbaar te maken op het forum.

source: Nickname
nl_nl: Bijnaam

source: Signature
nl_nl: Onderschrift

source: Language
nl_nl: Taal

source: New password
nl_nl: Nieuw wachtwoord

source: Current password
nl_nl: Huidige wachtwoord

source: Again
nl_nl: Opnieuw

source: Change password
nl_nl: Wijzig wachtwoord

source: Your photo is not only used on this website, but also in the annual yearbook. You want to use a more recent photo? Send in the best version you have! Submissions are processed by hand, so it might take a while for the new photo to show up.
nl_nl: Je foto wordt ook gebruikt op deze website, maar ook in de jaarlijkse almanak. Wil je een recentere foto hier hebben? Stuur de beste versie die je hebt in! Ze worden met de hand verwerkt, dus het kan even duren voordat hij aangepast is.

source: Personal
nl_nl: Persoonlijk

source: Change who can see these personal details on the <a href="%s">privacy tab</a>.
nl_nl: Verander wie deze gegevens kunnen zien in het <a href="%s">privacy tabblad</a>.

source: Photos of %s
nl_nl: Foto's van %s

source: Committees & Working groups
nl_nl: Commissies & Werkgroepen

source: %s is a member of the following committees:
nl_nl: %s is lid van de volgende commissies:

source: Sessions
nl_nl: Sessies

source: Here all currently open sessions listed which are logged-in to your account.
nl_nl: Hieronder staan alle sessies die voor jouw account nog open staan.

source: IP-address
nl_nl: IP-adres

source: Application
nl_nl: Applicatie

source: Last active
nl_nl: Laatst actief

source: End selected sessions
nl_nl: Sluit geselecteerde sessies

source: Profile of %s
nl_nl: Profiel van %s

source: Activity from %d
nl_nl: Agendapunt uit %d

source: Announcement made by %s in %d
nl_nl: Mededeling van %s uit %d

source: %s is a member of this committee
nl_nl: %s is een lid in deze commissie

source: in forum %s from %s %d
nl_nl: in het forum %s uit %s %d

source: Photo album in %s
nl_nl: Fotoboek in %s

source: Search query
nl_nl: Zoekopdracht

source: There is %d search result.
nl_nl: Er is %d zoekresultaat.

source: Search results from the %s category are missing due to errors.
nl_nl: Zoekresultaten uit de categorie %s ontbreken vanwege fouten.

source: Your account is no longer active because you are currently not a member nor a donor of Cover. Do you want to become one (again), or do you want your access to the site reinstated for other purposes? Contact the secretary, %s (secretary@svcover.nl).
nl_nl: Je account is niet langer actief omdat je op het moment niet lid of donateur van Cover bent. Wil je dat wel (weer) worden, of wil je om een andere reden toegang tot de site? Neem dan even contact op met %s (secretary@svcover.nl).

source: Sign up
nl_nl: Lid worden

source: Password
nl_nl: Wachtwoord

source: Keep me logged in
nl_nl: Blijf ingelogd

source: and continue to %s
nl_nl: en ga door naar %s

source: Forgot your password?
nl_nl: Wachtwoord vergeten?

source: Your session has been ended.
nl_nl: Je bent uitgelogd.

source: Impersonate a user
nl_nl: Website bekijken als een ander

source: Override committee memberships
nl_nl: Overschrijf commissielidmaatschappen

source: Override member id
nl_nl: Overschrijf lidnummer

source: Member id
nl_nl: Lidnummer

source: Apply
nl_nl: Stel in

source: Delete key
nl_nl: Sleutel verwijderen

source: Are you certain you want to delete the key <em>%s</em>?
nl_nl: Weet je heel zeker dat je de sleutel <em>%s</em> wil verwijderen?

source: Back to settings
nl_nl: Terug naar instellingen

source: Add a new key
nl_nl: Nieuwe sleutel toevoegen

source: Modify key
nl_nl: Sleutel wijzigen

source: Key
nl_nl: Sleutel

source: Value
nl_nl: Waarde

source: Add key
nl_nl: Voeg sleutel toe

source: Settings
nl_nl: Instellingen

source: Make a page
nl_nl: Nieuwe pagina maken

source: This value is often used in the code base to refer to a specific page.
nl_nl: Deze waarde wordt vaak in de code gebruikt om naar een specifieke pagina te verwijzen.

source: Dutch
nl_nl: Nederlands

source: English
nl_nl: Engels

source: Create page
nl_nl: Maak pagina

source: Show page
nl_nl: Bekijk pagina

source: Address field
nl_nl: Adresveld

source: Bank account number
nl_nl: Rekeningnummer

source: Checkbox
nl_nl: Vinkje

source: Multiple choice question
nl_nl: Meerkeuzevraag

source: Titles and text (layout)
nl_nl: Titels en tekst (lay-out)

source: Text
nl_nl: Tekst

source: Full name
nl_nl: Voor- en achternaam

source: Text field
nl_nl: Tekstveld

source: Delete field
nl_nl: Veld verwijderen

source: Back to form
nl_nl: Terug naar formulier

source: Delete form
nl_nl: Formulier verwijderen

source: Are you sure you want to delete this sign-up form?
nl_nl: Weet je heel zeker dat je het formulier wil verwijderen?

source: This will also delete all registrations. There is no way to undo this action.
nl_nl: Ook alle aanmeldingen worden hiermee verwijderd. Er is geen manier om dit ongedaan te maken.

source: Form
nl_nl: Formulier

source: Success! You have signed up.
nl_nl: Succes! Je inschrijving is compleet.

source: E.g. chris@gmail.com
nl_nl: Bijv. chris@gmail.com

source: E.g. John von Neumann
nl_nl: Bijv. John von Neumann

source: Add form
nl_nl: Formulier toevoegen

source: Show form
nl_nl: Bekijk formulier

source: Create form
nl_nl: Formulier maken

source: If you link the form to an activity, it will be shown next to the calendar entry.
nl_nl: Als je een activiteit kiest wordt het formulier bij het agendapunt getoond.

source: Sign-up period
nl_nl: Inschrijfperiode

source: Open date
nl_nl: Openingsdatum

source: People will be able to register from this date. Make sure you don't open registrations before you finished configuring the sign-up form.
nl_nl: Het formulier gaat open op deze datum. Let op dat je het formulier niet al open zet terwijl je het nog aan het maken bent.

source: Deadline
nl_nl: Sluitdatum

source: If you do not have a deadline, leave this field blank.
nl_nl: Als je nog geen sluitdatum hebt mag je dit veld leeg laten.

source: Template
nl_nl: Sjabloon

source: Choose a template to start with a set of predefined fields.
nl_nl: Kies een sjabloon als je alvast een aantal standaard velden wil toevoegen.

source: Delete this form…
nl_nl: Verwijder formulier…

source: Add a new %s to this form
nl_nl: Voeg een nieuw %s veld toe aan dit formulier

source: Add field
nl_nl: Voeg veld toe

source: Modify field
nl_nl: Wijzig veld

source: Sign-ups
nl_nl: Inschrijvingen

source: New sign-up
nl_nl: Nieuwe inschrijving

source: Download as CSV
nl_nl: Download als CSV

source: There is currently %d sign-up.
nl_nl: Op dit moment is er %d inschrijving.

source: Remove selected sign-ups
nl_nl: Verwijder geselecteerde inschrijvingen

source: Sign-up forms
nl_nl: Inschrijfformulieren

source: Subscriptions
nl_nl: Aanmeldingen

source: None of you committees is managing any sign-up forms.
nl_nl: Geen van jouw commissies beheert een inschrijfformulier.

source: Your committee is not managing any sign-up forms.
nl_nl: Jouw commissie beheert geen inschrijfformulieren.

source: To create a new form, click the ‘New sign-up form’ button above this table, or go to the activity and click the link in the footer.
nl_nl: Klik op de ‘Niew inschrijfformulier’ knop om een nieuw formulier te maken, of klik op de link onder het agendapunt van de activiteit.

source: Right now this feature is being tested by a few committees. If you want to use this feature for your activity as well, contact the AC/DCee.
nl_nl: Op dit moment wordt deze functie door een paar commissies getest. Neem contact op met de AC/DCee als je deze functie ook wilt gebruiken voor jouw activiteit.

source: Restore field
nl_nl: Veld terughalen

source: This %s is deleted.
nl_nl: Dit %s is verwijderd.

source: Update sticker
nl_nl: Sticker wijzigen

source: Add a new sticker
nl_nl: Nieuwe sticker toevoegen

source: E.g. on a lamppost
nl_nl: Bijv. op de lantaarnpaal

source: Drag or right click to place the marker
nl_nl: Sleep of klik met de rechter muisknop om de marker te plaatsen

source: Add sticker to map
nl_nl: Zet sticker op kaart

source: Sticker map
nl_nl: Stickerkaart

source: New sticker
nl_nl: Nieuwe sticker

source: Delete sticker
nl_nl: Verwijder sticker

source: Are you sure you want to delete your sticker from the map?
nl_nl: Weet je zeker dat je je sticker wil verwijderen?

source: An e-mail has been sent to %s. Follow the instructions in the mail to confirm your request for a new password.
nl_nl: Er is een mailtje gestuurd naar %s. Volg de aanwijzingen hierin op om de aanvraag van een nieuw wachtwoord te bevestigen.

source: There is no account with the given E-mail address (%s).
nl_nl: Er bestaat geen account met het opgegeven E-Mail adres (%s).

source: Fill in your email address and click on `Reset password`. You will then receive an email with further instructions.
nl_nl: Vul hieronder je e-mailadres in en druk op de `Reset wachtwoord` knop. Hierna wordt er een mailtje naar dat adres gestuurd met verdere aanwijzingen.

source: Reset password
nl_nl: Reset wachtwoord

source: Your password has been changed.
nl_nl: Je wachtwoord is opnieuw ingesteld.

source: Your password is too short or too predictable. Try to make it longer and with more different characters.
nl_nl: Je wachtwoord is te kort, of te voorspelbaar. Maak het langer of gebruik wat meer verschillende karakters.

source: The two passwords are not the same.
nl_nl: De twee wachtwoorden komen niet overeen.

source: Choose a new password. Long passwords are great, passwords with different character types as well.
nl_nl: Kies een nieuw wachtwoord. Lange wachtwoorden zijn prima, wachtwoorden met veel verschillende karakters ook.

source: Repeat password
nl_nl: Herhaal wachtwoord

source: Set password
nl_nl: Stel wachtwoord in

source: There are no blog posts at this moment
nl_nl: Er zijn op dit moment geen weblogs

source: Previous page
nl_nl: Vorige pagina

source: Next page
nl_nl: Volgende pagina

source: The new calendar event is now waiting for approval. Once the governing board has accepted the event, it shall be placed on the website.
nl_nl: Het nieuwe agendapunt is in de wachtrij geplaatst. Zodra het bestuur ernaar gekeken heeft zal het punt op de website geplaatst worden.

source: The changes you've made to this activity have been published.
nl_nl: De wijzigingen voor het agendapunt zijn geplaatst.

source: The changes to the calendar event are waiting for approval. Once the governing board has accepted the event, it shall be placed on the website.
nl_nl: De wijzigingen voor het agendapunt zijn opgestuurd. Zodra het bestuur ernaar gekeken heeft zal het punt op de website gewijzigd worden.

source: The committee %s has been notified of the denying of the calendar event.
nl_nl: De commissie %s is op de hoogte gesteld van het weigeren van het agendapunt.

source: The committee %s has been notified of the denying of the calendar events.
nl_nl: De commissie %s is op de hoogte gesteld van het weigeren van de agendapunten.

source: The committees %s have been notified of the denying of the calendar events.
nl_nl: De commissies %s zijn op de hoogte gesteld van het weigeren van de agendapunten.

source: All activities of study association Cover
nl_nl: Alle activiteiten van studievereniging Cover

source: Boards
nl_nl: Besturen

source: There is a problem with the menu, if this keeps occuring, contact the Easy at easy@ai.rug.nl
nl_nl: Er is geen menu opgegeven, mocht dit vaker voorkomen neem dan contact op met easy@ai.rug.nl

source: This action cannot be done, if this keeps occuring contact the easy at easy@ai.rug.nl
nl_nl: Deze actie kan niet worden behandeld, mocht dit vaker voorkomen neem dan contact op met easy@ai.rug.nl

source: Could not find the model %s
nl_nl: Kan het model %s niet vinden

source: Invalid e-mail address
nl_nl: Ongeldig e-mailadres

source: Error
nl_nl: Fout

source: The webmaster has NOT been informed. Please inform the webmaster if this problem keeps occurring
nl_nl: De webmaster is NIET op de hoogte gesteld. Stel de webmaster op de hoogte wanneer dit probleem zich voor blijft doen

source: The webmaster has been notified of the problem
nl_nl: De webmaster is op de hoogte gesteld van het probleem

source: The view %s could not be found (theme: %s)
nl_nl: De view `%s` kan niet gevonden worden (thema: %s)

source: The view function %s in %s could not be found (theme: %s)
nl_nl: De view functie `%s` in `%s` kan niet gevonden worden (thema: %s)

source: Sunday
nl_nl: Zondag

source: Monday
nl_nl: Maandag

source: Tuesday
nl_nl: Dinsdag

source: Wednesday
nl_nl: Woensdag

source: Thursday
nl_nl: Donderdag

source: Friday
nl_nl: Vrijdag

source: Saturday
nl_nl: Zaterdag

source: no
nl_nl: geen

source: January
nl_nl: Januari

source: February
nl_nl: Februari

source: March
nl_nl: Maart

source: May
nl_nl: Mei

source: June
nl_nl: Juni

source: July
nl_nl: Juli

source: August
nl_nl: Augustus

source: October
nl_nl: Oktober

source: Mar
nl_nl: Mrt

source: Oct
nl_nl: Okt

source: $from_dayname $from_day|ordinal of $from_month
nl_nl: $from_dayname $from_day $from_month

source: $from_dayname $from_day|ordinal of $from_month, $from_time
nl_nl: $from_dayname $from_day $from_month, $from_time

source: $from_dayname $from_day|ordinal of $from_month $from_time till $till_dayname $till_day|ordinal of $till_month $till_time
nl_nl: $from_dayname $from_day $from_month $from_time tot $till_dayname $till_day $till_month $till_time

source: $from_dayname $from_day|ordinal of $from_month, $from_time till $till_time
nl_nl: $from_dayname $from_day $from_month, $from_time tot $till_time

source: starts at $from_time
nl_nl: vanaf $from_time

source: $from_month $from_day|ordinal till $till_month $till_day|ordinal
nl_nl: $from_day $from_month tot $till_day $till_month

source: $from_day|ordinal till $till_day|ordinal of $till_month
nl_nl: $from_day tot $till_day $till_month

source: $from_time till $till_time
nl_nl: $from_time tot $till_time

source: now
nl_nl: nu

source: just
nl_nl: net

source: 1 minute ago
nl_nl: 1 minuut geleden

source: %d minutes ago
nl_nl: %d minuten geleden

source: 1 hour ago
nl_nl: 1 uur geleden

source: %d hours ago
nl_nl: %d uren geleden

source: Yesterday
nl_nl: Gisteren

source: %d days ago
nl_nl: %d dagen geleden

source: E.g. %d-9-20
nl_nl: Bijv. %d-9-20

source: E.g. %d-9-20 11:00
nl_nl: Bijv. %d-9-20 11:00

source: Required
nl_nl: Verplicht

source: No name
nl_nl: Geen naam

source: You!
nl_nl: Jij!

source: All members
nl_nl: Alle leden

source: Group
nl_nl: Groep

source: Hidden
nl_nl: Onzichtbaar

source: No status
nl_nl: Geen status

source: and
nl_nl: en

source: Liked photos
nl_nl: Favoriete foto's

source: E-mail address field
nl_nl: E-mailadresveld

source: Go to page
nl_nl: Ga naar pagina

source: previous
nl_nl: vorige

source: next
nl_nl: volgende

source: You are being redirected. Click here to continue.
nl_nl: Je wordt doorgestuurd. Klik hier om verder te gaan.

source: Confirm membership application
nl_nl: Lidmaatschapsaanvraag bevestigen

source: Chairman
nl_nl: Voorzitter

source: Vice Chairman
nl_nl: Vice-voorzitter

source: Secretary
nl_nl: Secretaris

source: Treasurer
nl_nl: Penningmeester

source: General Member
nl_nl: Algemeen Lid
