Repository: sv-cover/cover-php
Catalog: locale/*/LC_MESSAGES/cover-web.po
Languages: nl_nl

source: No access
nl_nl: Geen toegang

source: or
nl_nl: of

source: Become a member
nl_nl: Word lid van Cover

source: Not found
nl_nl: Niet gevonden

source: Do you think this is a mistake? Report it to the AC/DCee at acdcee@svcover.nl!
nl_nl: Denk je dat dit een fout is? Meld het en mail naar acdcee@svcover.nl!

source: Back to homepage
nl_nl: Terug naar homepage

source: Sorry, something went horribly wrong. Please try again in a bit or contact the WebCie (webcie@svcover.nl)
nl_nl: Sorry, er ging iets verschrikkelijk mis. Probeer het later nog eens of mail de WebCie (webcie@svcover.nl)

source: Modify page
nl_nl: Bewerk pagina

source: Study Association for Artificial Intelligence and Computing Science
nl_nl: Studievereniging Kunstmatige Intelligentie en Informatica, RUG

source: There is %d activity waiting for your confirmation
nl_nl: Er staat nog %d agendapunt in de wachtrij

source: Your application hasn't been accepted yet by our secretary. Until then some parts of the website are not yet accessible, such as all the photo albums and contact information of members.
nl_nl: Je lidmaatschap is nog niet goedgekeurd door de secretaris. Tot dan is de toegang tot sommige delen van de website, zoals de oude foto's en lidgegevens, beperkt.

source: Calendar
nl_nl: Agenda

source: External activity
nl_nl: Externe activiteit

source: Not yet published
nl_nl: Nog niet gepubliceerd

source: There are no activities on the calendar at the moment.
nl_nl: Er staan op dit moment geen activiteiten op de agenda.

source: Complete calendar
nl_nl: Volledige agenda

source: Birthdays
nl_nl: Jarigen

source: There is %d birthday today:
nl_nl: Er is vandaag %d jarige:

source: Main partner
nl_nl: Hoofdpartner

source: Battle your way to the top!
nl_nl: Vecht jouw commissie naar de top!

source: Take part!
nl_nl: Doe mee!

source: Logged in
nl_nl: Ingelogd

source: Logout
nl_nl: Uitloggen

source: Profile
nl_nl: Profiel

source: Impersonate…
nl_nl: Bekijk als…

source: Change Language
nl_nl: Verander taal

source: There is no poll at the moment
nl_nl: Er is op dit moment geen poll

source: For books, career and fun.
nl_nl: Voor boeken, carrière en gezelligheid.

source: Join now!
nl_nl: Meld je aan!

source: Active Members
nl_nl: Actieve leden

source: Taking all committees and working groups together, there are currently <strong>%d</strong> active Cover members.
nl_nl: In alle commisses en werkgroepen samen zitten op dit moment <strong>%d</strong> actieve Coverleden.

source: Name
nl_nl: Naam

source: Committees/Working groups
nl_nl: Commissies/Werkgroepen

source: Delete calendar event
nl_nl: Agendapunt verwijderen

source: Are you certain you want to delete the calendar event <em>%s</em>?
nl_nl: Weet je heel zeker dat je het agendapunt <em>%s</em> wil verwijderen?

source: Back to calendar event
nl_nl: Terug naar agendapunt

source: Modify calendar event
nl_nl: Wijzig agendapunt

source: Add a calendar event
nl_nl: Agendapunt toevoegen

source: You haven't filled in all the fields correctly
nl_nl: Niet alle velden zijn goed ingevuld

source: Head
nl_nl: Kop

source: Committee
nl_nl: Commissie

source: Starting time
nl_nl: Begintijd

source: End time
nl_nl: Eindtijd

source: Location
nl_nl: Locatie

source: Description
nl_nl: Beschrijving

source: Preview
nl_nl: Voorbeeld

source: Loading preview…
nl_nl: Voorbeeld wordt geladen…

source: Only visible to members
nl_nl: Alleen zichtbaar voor leden

source: Create calendar event
nl_nl: Plaats agendapunt

source: New calendar event
nl_nl: Nieuw agendapunt

source: Log in to view hidden calendar events.
nl_nl: Log in om eventuele afgeschermde agendapunten te bekijken.

source: Show the complete year %d-%d
nl_nl: Toon alles uit het jaar %d-%d

source: Show current agenda
nl_nl: Toon actuele agenda

source: This activity is not organised by Cover.
nl_nl: Deze activiteit wordt niet georganiseerd door Cover zelf.

source: Delete
nl_nl: Verwijder

source: Modify
nl_nl: Wijzig

source: Add the Cover Calendar to your own calendar:
nl_nl: Voeg de Coveragenda toe aan je eigen agenda:

source: There are no calendar events waiting for approval.
nl_nl: Er staan geen agendapunten in de wachtrij om goedgekeurd te worden.

source: The calendar events below are put up for approval.
nl_nl: Onderstaande agendapunten staan in de wachtrij om goedgekeurd te worden.

source: Date
nl_nl: Datum

source: Private
nl_nl: Privé

source: Accept calendar event
nl_nl: Accepteer agendapunt

source: Deny calendar event
nl_nl: Weiger agendapunt

source: Apply changes
nl_nl: Toepassen

source: You signed up on %s.
nl_nl: Je hebt je aangemeld op %s.

source: Show my registration
nl_nl: Bekijk je aanmelding

source: The registrations are closed.
nl_nl: De inschrijvingen zijn gesloten.

source: You can see this form because you are allowed to sign up people outside of the sign-up period.
nl_nl: Jij kan dit formulier nu wel zien omdat je de rechten hebt om mensen in te schrijven buiten de inschrijfperiode.

source: The sign-up form will soon be available on this page.
nl_nl: Het inschrijfformulier is hier binnenkort te vinden.

source: The registrations will open on %s.
nl_nl: De inschrijvingen gaan open op %s.

source: The registrations are closed. The deadline was %s.
nl_nl: De inschrijvingen zijn gesloten. De deadline voor inschrijven was %s.

source: Modify entry
nl_nl: Wijzig inschrijving

source: Sign me up
nl_nl: Schrijf mij in

source: Modify form
nl_nl: Bewerk formulier

source: Show sign-ups
nl_nl: Bekijk inschrijvingen

source: This activity has not yet been published. It still needs to be accepted by the Board.
nl_nl: Dit agendapunt is nog niet gepubliceerd. Het moet nog worden goedgekeurd door Bestuur.

source: This revision of the activity has not yet been published.
nl_nl: Deze versie van dit agendapunt is nog niet gepubliceerd.

source: There is <a href="%s">a change on this activity</a> that is not yet published.
nl_nl: Er is <a href="%s">een wijziging op dit agendapunt</a> dat nog niet gepubliceerd is.

source: Going
nl_nl: Aanwezig

source: Maybe
nl_nl: Misschien

source: Not going
nl_nl: Gaat niet

source: Connect to Facebook
nl_nl: Koppel Facebook

source: Show on Facebook
nl_nl: Toon op Facebook

source: Date & time
nl_nl: Datum & Tijd

source: Placed by
nl_nl: Geplaatst door

source: %s to sign-up for this activity.
nl_nl: %s om je aan te melden voor deze activiteit.

source: New sign-up form
nl_nl: Nieuw inschrijfformulier

source: Subscribe to Cover's calendar
nl_nl: Abonneer je op de agenda

source: Add your Cover calendar to your personal calendar to stay up-to-date on the latest activities, always.
nl_nl: Voeg jouw Cover-agenda toe aan jouw eigen agenda, zodat je altijd kan zien wat er te doen is.

source: Add to my %s
nl_nl: Voeg toe aan mijn %s

source: The link to the Cover calendar is personalized to let you also see the activities that only you as a member of Cover may see.
nl_nl: De Cover-agendalink is persoonlijk zodat je ook alle activiteiten die jij alleen als lid mag zien kan zien.

source: That is why you need to log in.
nl_nl: Daarom moet je eerst even inloggen.

source: Almanac
nl_nl: Almanak

source: Search
nl_nl: Zoek

source: Visibility
nl_nl: Zichtbaarheid

source: Member
nl_nl: Lid

source: Member (hidden)
nl_nl: Lid (verborgen)

source: Previously a member
nl_nl: Lid af

source: Honorary Member
nl_nl: Erelid

source: Donor
nl_nl: Donateur

source: Make a selection above to view the almanac.
nl_nl: Maak hierboven een selectie om de almanak te bekijken.

source: Download yearbook data:
nl_nl: Download almanakgegevens:

source: CSV with personal details
nl_nl: CSV met persoonsgegevens

source: ZIP archive with profile pictures
nl_nl: ZIP met foto's

source: There is <em>%d</em> member that coincide with your searching criteria.
nl_nl: Er is <em>%d</em> lid gevonden die voldoet aan de zoekterm(en).

source: Add a new announcement
nl_nl: Nieuwe mededeling

source: Announcements
nl_nl: Mededelingen

source: There is %d announcement which is only available to members. Log in to read it.
nl_nl: Er is %d mededeling alleen beschikbaar voor leden. Log in om deze te lezen.

source: Show all announcements
nl_nl: Alle mededelingen bekijken

source: Delete announcement
nl_nl: Mededeling verwijderen

source: Are you certain you want to delete the announcement <em>%s</em>?
nl_nl: Weet je heel zeker dat je de mededeling <em>%s</em> wil verwijderen?

source: Back to announcement
nl_nl: Terug naar mededeling

source: Modify announcement
nl_nl: Mededeling wijzigen

source: Post as committee
nl_nl: Plaats namens commissie

source: Visible to
nl_nl: Zichtbaar voor

source: Subject
nl_nl: Onderwerp

source: Message
nl_nl: Bericht

source: Post announcement
nl_nl: Plaats mededeling

source: Back to all announcements
nl_nl: Terug naar alle mededelingen

source: Modify board
nl_nl: Bestuur wijzigen

source: Add a new board
nl_nl: Nieuwe oud-bestuur toevoegen

source: Board name
nl_nl: Bestuursnaam

source: Sort order name
nl_nl: Sorteernaam

source: This value is not visible and is solely used for determining the order of the boards.
nl_nl: Deze waarde is nergens zichtbaar maar wordt alleen gebruikt om de sorteervolgorde van de besturen goed te krijgen.

source: Add board
nl_nl: Voeg bestuur toe

source: Back to the former boards
nl_nl: Terug naar de oud-besturen

source: Former boards
nl_nl: Oud-besturen

source: Add a new board...
nl_nl: Nieuw bestuur toevoegen...

source: Order books
nl_nl: Boeken bestellen

source: Continue to the BookCee webshop
nl_nl: Ga verder naar de BookCee webshop

source: Committee agenda
nl_nl: Commissieagenda

source: E-mail the %s at %s
nl_nl: E-mail de %s via %s

source: Members
nl_nl: Leden

source: Hey! This committee is looking for new members. Are you interested? Tell your Commissioner of Internal Affairs, %s (intern@svcover.nl)
nl_nl: Hey! Deze commissie zoekt nieuwe commissieleden. Heb jij interesse? Zeg het de Commissaris Intern, %s (intern@svcover.nl)

source: Hey! This committee is looking for new members. Are you interested? Tell your Commissioner of Internal Affairs, %s (intern@svcover.nl) <strong>before %s</strong>
nl_nl: Hey! Deze commissie zoekt nieuwe commissieleden. Heb jij interesse? Zeg het tegen de Commissaris Intern, %s (intern@svcover.nl) <strong>voor %s</strong>

source: Hey! This committee is looking for new members. Are you interested? Tell your Commissioner of Internal Affairs by e-mailing to intern@svcover.nl.
nl_nl: Hey! Deze commissie zoekt nieuwe commissieleden. Heb jij interesse? Zeg het de Intern via intern@svcover.nl.

source: I’m interested!
nl_nl: Ik ben geïnteresseerd!

source: Groups
nl_nl: Groepen

source: New committee
nl_nl: Nieuwe commissie

source: Active
nl_nl: Actief

source: Edit
nl_nl: Bewerk

source: Inactive
nl_nl: Inactief

source: Delete committee
nl_nl: Commissie verwijderen

source: Are you certain you want to delete <em>%s</em> committee?
nl_nl: Weet je heel zeker dat je de commissie <em>%s</em> wil verwijderen?

source: Back to committee page
nl_nl: Terug naar commissie

source: Modify committee/working group
nl_nl: Commissie/werkgroep wijzigen

source: Add a new committee/working group
nl_nl: Nieuwe commissie/werkgroep maken

source: This committee/working group is deactivated
nl_nl: Deze commissie/werkgroep is gedeactiveerd

source: Function
nl_nl: Functie

source: Add
nl_nl: Toevoegen

source: This committee/working group is looking for new members till
nl_nl: Deze commissie/werkgroep zoekt nieuwe leden tot

source: A banner with the face of the Commissioner of Internal Affairs is shown on the pages of committees or working groups who have vacancies. If you don't have a specific deadline, enter a value more than a year into the future. If the committee or working group is not looking for new members, leave the field empty.
nl_nl: Commissies en werkgroepen die leden zoeken hebben een banner met het hoofd van de Intern op de website en op het scherm. De datum is de deadline. Geef een datum meer dan een jaar in de toekomst om geen specifieke te tonen. Laat het veld leeg als de commissie geen nieuwe leden zoekt.

source: Modify %s
nl_nl: Wijzig %s

source: Create new committee/working group
nl_nl: Maak commissie/werkgroep aan

source: Return to %s
nl_nl: Terug naar %s

source: Back to all committees
nl_nl: Terug naar alle commissies

source: Deactivate
nl_nl: Deactiveer

source: Committees
nl_nl: Commissies

source: Looking for new members!
nl_nl: Commissieleden gezocht!

source: Committee archive
nl_nl: Commissiearchief

source: Cool! We’ve notified the Commissioner of Internal Affairs for you!
nl_nl: Cool! Je interesse is doorgegeven aan de Commissaris Intern!

source: Modify %s page
nl_nl: Bewerk %spagina

source: Working groups
nl_nl: Werkgroepen

source: New working group
nl_nl: Nieuwe werkgroep

source: Reason
nl_nl: Reden

source: Points
nl_nl: Punten

source: Delete points
nl_nl: Score verwijderen

source: Are you sure you want to delete the points awarded for <em>%s</em>?
nl_nl: Weet je heel zeker dat je de punten voor <em>%s</em> wil verwijderen?

source: Award points
nl_nl: Nieuwe punten toekennen

source: Update points
nl_nl: Punten wijzigen

source: Add points
nl_nl: Voeg punten toe

source: Back to index
nl_nl: Terug naar het overzicht

source: Rank
nl_nl: Positie

source: Update description
nl_nl: Bewerk omschrijving

source: Log in to Microsoft Imagine
nl_nl: Inloggen op Microsoft Imagine

source: To log in to the Microsoft Imagine Webstore we need to pass your name and e-mail address to Microsoft.
nl_nl: Als je doorgaat worden je naam en e-mailadres doorgegeven aan de Microsoft Imagine webstore.

source: Log in as WebCie administrator
nl_nl: Log in als WebCie admin

source: Continue to the Microsoft Imagine Webstore
nl_nl: Ga verder naar de Microsoft Imagine Webstore

source: Vote
nl_nl: Stem

source: Number of votes
nl_nl: Aantal stemmen

source: Log in to vote
nl_nl: Log in om te stemmen

source: New poll
nl_nl: Nieuwe poll

source: Remove message
nl_nl: Bericht verwijderen

source: Are you sure you want to delete this message?
nl_nl: Weet je heel zeker dat je het bericht wil verwijderen?

source: Back to thread
nl_nl: Terug naar thread

source: New Topic
nl_nl: Nieuw onderwerp

source: New poll
nl_nl: Nieuwe poll

source: Author
nl_nl: Auteur

source: Comments
nl_nl: Reacties

source: Last
nl_nl: Laatste

source: Page
nl_nl: Pagina

source: Unknown
nl_nl: Onbekend

source: Modify forum
nl_nl: Bewerk forum

source: Create new forum
nl_nl: Maak nieuw forum aan

source: Back to forum
nl_nl: Terug naar forum

source: Option %d
nl_nl: Optie %d

source: Subject/question
nl_nl: Vraag

source: Publish poll
nl_nl: Plaats poll

source: Modify message
nl_nl: Wijzig bericht

source: Publish message
nl_nl: Plaats bericht

source: Show message in thread
nl_nl: Bekijk bericht in thread

source: New comment
nl_nl: Nieuw antwoord

source: Delete topic
nl_nl: Verwijder onderwerp

source: Move message to
nl_nl: Verplaats bericht naar

source: Are you sure you want to delete the whole <em>%s</em> topic, including all its messages?
nl_nl: Weet je heel zeker dat je het hele onderwerp <em>%s</em> en alle berichten wil verwijderen?

source: Back to topic
nl_nl: Terug naar onderwerp

source: Public
nl_nl: Publiek

source: Only logged in members
nl_nl: Alleen ingelogde leden

source: Only logged in active members
nl_nl: Alleen ingelogde actieve leden

source: Only logged in members of the PhotoCee
nl_nl: Alleen ingelogde leden van de PhotoCee

source: This photo originates from
nl_nl: Deze foto komt uit

source: Hidden from index
nl_nl: Verborgen voor anderen

source: %d comment
nl_nl: %d reactie

source: New since your last visit
nl_nl: Nieuw sinds je laatste bezoek

source: Older photos
nl_nl: Oudere foto's

source: Random photos
nl_nl: Willekeurige foto's

source: Last comments
nl_nl: Laatste reacties

source: no title
nl_nl: geen titel

source: Add photos
nl_nl: Foto's toevoegen

source: Photo album
nl_nl: Fotoboek

source: Photo album statistics
nl_nl: Fotoboek statistieken

source: Most active taggers
nl_nl: Meest taggende leden

source: Count
nl_nl: Aantal

source: Favorite
nl_nl: Favoriet

source: Most tagged members
nl_nl: Meest getagde leden

source: Times tagged
nl_nl: Aantal maal getagged

source: Delete photo album
nl_nl: Fotoboek verwijderen

source: Are you sure you want to delete the <em>%s</em> photo album?
nl_nl: Weet je heel zeker dat je het fotoboek <em>%s</em> wil verwijderen?

source: As confirmation, enter the name of the photo album you are about to entirely delete
nl_nl: Typ om dit fotoboek te verwijderen de naam van het fotoboek over ter bevestiging

source: Return to photo album
nl_nl: Terug naar fotoboek

source: Faces
nl_nl: Gezichten

source: New photo album
nl_nl: Nieuw fotoboek

source: Modify photo album
nl_nl: Bewerk fotoboek

source: Reorder photos
nl_nl: Foto's herschikken

source: Delete selected photos
nl_nl: Geselecteerde foto's verwijderen

source: Are you sure you want to delete the %d selected photos?
nl_nl: Weet je zeker dat je %d geselecteerde foto's wilt verwijderen?

source: The order could not be saved. Generally, the order cannot be saved when the album is automatically generator or you don’t have permission to update the album.
nl_nl: De volgorde kon niet worden opgeslagen. De volgorde kan niet worden opgeslagen voor automatisch gegenereerde albums en albums waar je geen update-rechten voor hebt.

source: Welcome at Covers photo album. This part of the site is maintained by the %s. Please inform the PhotoCee when you made photos at an activity so they can add them to the photo album.
nl_nl: Welkom op het fotoboek van Cover. Dit deel van de site wordt onderhouden door de %s. Heb je zelf nog leuke (digitale) fotos van een activiteit, meld dat dan aan de PhotoCee.

source: Download photo album
nl_nl: Download fotoboek

source: Mark all albums as seen
nl_nl: Markeer alle boeken als gezien

source: Photographer
nl_nl: Fotograaf

source: There are no photos in this photo album yet
nl_nl: Er zijn nog geen foto's in dit fotoboek

source: Are you sure you want to download <a href="%s">%s</a> and all of its sub albums?
nl_nl: Weet je heel zeker dat je het fotoboek <a href="%s">%s</a> en alle sub-boeken wil downloaden?

source: Note that you will be downloading %d originals. That is <strong>%s</strong> in total!
nl_nl: Let op dat je dan %d originele foto's download. Dat is in totaal <strong>%s</strong> aan fotos!

source: Download %s as a ZIP (%s)
nl_nl: Download %s als ZIP (%s)

source: Add a new photo album
nl_nl: Nieuw fotoboek maken

source: Add photo album
nl_nl: Maak fotoboek

source: Title
nl_nl: Titel

source: Part of
nl_nl: Onderdeel van

source: Date (dd-mm-yyyy)
nl_nl: Datum (dd-mm-yyyy)

source: Visibility of photo
nl_nl: Zichtbaarheid foto

source: Show photo in my personal photo album
nl_nl: Toon in het overzicht van mij

source: Hide from my personal photo album
nl_nl: Laat weg uit het overzicht van mij

source: Change visibility
nl_nl: Zichtbaarheid instellen

source: Photo
nl_nl: Foto

source: Previous
nl_nl: Vorige

source: Next
nl_nl: Volgende

source: Click to tag
nl_nl: Klik om te taggen

source: Not yet tagged
nl_nl: Niet getagged

source: A photo with %s.
nl_nl: Een foto met %s.

source: %d unknown faces
nl_nl: %d onbekend gezicht

source: and
nl_nl: en

source: Tag faces
nl_nl: Tag gezichten

source: Type your comment here…
nl_nl: Typ hier je reactie…

source: Modify comment
nl_nl: Wijzig reactie

source: Post comment
nl_nl: Plaats reactie

source: Return to photo
nl_nl: Terug naar foto

source: Remove comment
nl_nl: Reactie verwijderen

source: Are you certain you want to delete the comment posted by <em>%s</em>?
nl_nl: Weet je heel zeker dat je de reactie van <em>%s</em> wilt verwijderen?

source: There are no comments yet
nl_nl: Er zijn nog geen reacties

source: Modify introduction
nl_nl: Bewerk introductie

source: Confirm email address
nl_nl: E-mailadres bevestigen

source: Your email address has been confirmed. Dazzling! You should receive another email soon with your password and a bit of information on how the website works, how to order books, etc.
nl_nl: Je e-mailadres is bevestigd. Top! Je krijgt zo nog een mailtje met je wachtwoord en een kleine introductie over hoe de website werkt, hoe je boeken besteld, etc.

source: Membership application form
nl_nl: Lidmaatschapsformulier

source: Your email address is already known to us, which means you are already in our member administration! In this case it is easier to quickly contact the secretary of Cover via secretary@svcover.nl.
nl_nl: Het e-mailadres dat je gebruikt is al bekend bij ons, dus waarschijnlijk zit je al in onze administratie! In dat geval is het makkelijker om even contact op te nemen met de secretaris via secretary@svcover.nl.

source: Reset your password
nl_nl: Reset je wachtwoord

source: Become a member!
nl_nl: Word lid van Cover!

source: You haven't filled in all the fields correctly.
nl_nl: Niet alle velden zijn goed ingevuld.

source: First name
nl_nl: Voornaam

source: E.g. John
nl_nl: Bijv. John

source: Infix
nl_nl: Tussenvoegsel

source: E.g. von
nl_nl: Bijv. von

source: Last name
nl_nl: Achternaam

source: E.g. Neumann
nl_nl: Bijv. Neumann

source: Birthdate
nl_nl: Geboortedatum

source: E.g. 1993-9-20
nl_nl: Bijv. 1993-9-20

source: Unspecified
nl_nl: Niet gespecificeerd

source: Male
nl_nl: Man

source: Female
nl_nl: Vrouw

source: Address
nl_nl: Adres

source: Street name + number
nl_nl: Straatnaam + Huisnummer

source: E.g. Nijenborgh 9
nl_nl: Bijv. Nijenborgh 9

source: Zipcode
nl_nl: Postcode

source: E.g. 9747 AG
nl_nl: Bijv. 9747 AG

source: Place of residence
nl_nl: Woonplaats

source: E.g. Groningen
nl_nl: Bijv. Groningen

source: Phone number
nl_nl: Telefoonnummer

source: E-mail address
nl_nl: E-Mail adres

source: You will receive a confirmation email with a link. Your application will be processed after you have clicked the link.
nl_nl: Je ontvangt een bevestigingsmail met een link. Je aanmelding wordt pas verwerkt wanneer je op de link klikt.

source: Study
nl_nl: Studie

source: Student number
nl_nl: Studentnummer

source: E.g. s123456
nl_nl: Bijv. s123456

source: Pick one from the list or type if your study isn't on it
nl_nl: Kies uit de lijst of typ een andere studie

source: Phase
nl_nl: Fase

source: Starting year
nl_nl: Beginjaar

source: In which year did you start or are you expecting to start with your study.
nl_nl: In welk jaar ben je begonnen of ga je beginnen met de hierboven ingevulde studie.

source: Payment
nl_nl: Betaling

source: Only required if your IBAN [i]does not[/i] start with 'NL'
nl_nl: Alleen nodig wanneer IBAN [i]niet[/i] met 'NL' begint

source: I hereby authorize Cover to automatically deduct the membership fee from my bank account one time per year. (mandatory)
nl_nl: Ik machtig hierbij Cover om 1x per jaar de contributie automatisch van mijn rekening af te schrijven (verplicht)

source: Mailing list
nl_nl: Mailing

source: From time to time Cover sends an email about an upcoming activity. If you don't want to receive these emails anymore, you can very easily unsubscribe right here on the website.
nl_nl: Cover stuurt af en toe een mailtje over aankomende activiteiten. Als je de mail niet meer wil ontvangen, kan je je heel gemakkelijk uitschrijven via de website.

source: I want to receive emails about activities organized by Cover.
nl_nl: Ik wil graag e-mails over activiteiten van Cover ontvangen.

source: You can unsubscribe at any moment through this website.
nl_nl: Afmelden kan op ieder moment via deze website.

source: Conditions
nl_nl: Voorwaarden

source: Modify conditions
nl_nl: Bewerk voorwaarden

source: Intelligence test
nl_nl: Intelligentietest
