Repository: sv-cover/cover-php
Catalog: locale/*/LC_MESSAGES/cover-web.po
Languages: nl_nl

source: Commissioner of Internal Affairs
nl_nl: Commissaris Intern

source: Commissioner of External Affairs
nl_nl: Commissaris Extern

source: Senior Member
nl_nl: Ouderejaars Lid

source: Commissioner Healthcare Allowance
nl_nl: Commissaris Zorgtoeslag

source: Commissioner Boo-boo
nl_nl: Commissaris Kusje

source: Commissioner Bandage box
nl_nl: Commissaris Verbanddoos

source: General Practitioner
nl_nl: Huisarts

source: GP assistant
nl_nl: Huisarts-assistent

source: Commissioner Fire Chief
nl_nl: Commissaris Heethoofd

source: Type here to search…
nl_nl: Typ hier om te zoeken…

source: The following fields are not correctly filled in:
nl_nl: De volgende velden zijn onjuist ingevuld:

source: We’ve sent a confirmation mail to your new email address.
nl_nl: Er is een bevestigingsmailtje naar je nieuwe e-mailadres gestuurd.

source: The following fields are to long:
nl_nl: De volgende velden zijn te lang:

source: The current password is incorrect.
nl_nl: Het huidige wachtwoord is onjuist.

source: The new password hasn't been filled in.
nl_nl: Het nieuwe wachtwoord is niet ingevuld.

source: The new password hasn't been filled in correctly twice.
nl_nl: Het nieuwe wachtwoord is niet twee keer hetzelfde ingevuld.

source: Your new password is too short.
nl_nl: Het nieuwe wachtwoord is te kort.

source: The image file is too large. The maximum file size is %s.
nl_nl: Het fotobestand is te groot. Het maximum is %s.

source: The image hasn’t been uploaded correctly. PHP reports error code %d.
nl_nl: Het bestand is niet geupload. Foutcode %d.

source: The image file is not a file uploaded by PHP.
nl_nl: Bestand is niet een door PHP geupload bestand.

source: The uploaded file could not be read.
nl_nl: Het geuploadde bestand kon niet worden gelezen.

source: The uploaded file could not be opened.
nl_nl: Het geuploadde bestand kon niet worden geopend.

source: Your photo has been submitted. It may take a while before it will be updated.
nl_nl: Je foto is ingestuurd. Het kan even duren voordat hij is aangepast.

source: members
nl_nl: leden

source: pages
nl_nl: pagina's

source: committees
nl_nl: commissies

source: calendar events
nl_nl: agendapunten

source: photo books
nl_nl: fotoboeken

source: announcements
nl_nl: mededelingen

source: wiki pages
nl_nl: wiki-pagina's

source: Wrong combination of e-mail address and password
nl_nl: Verkeerde combinatie van e-mailadres en wachtwoord

source: Sign-up form for a paid activitee
nl_nl: Inschrijfformulier voor betaalde activiteit

source: Association
nl_nl: Vereniging

source: Governing Board
nl_nl: Bestuur

source: Former Boards
nl_nl: Vorige besturen

source: Sister Associations
nl_nl: Zusterverenigingen

source: Become a member/donor
nl_nl: Lid/donateur worden

source: Documents
nl_nl: Documenten

source: Documents & Templates
nl_nl: Standaardocumenten

source: Companies
nl_nl: Bedrijven

source: Company profiles
nl_nl: Bedrijfsprofielen

source: Vacancies
nl_nl: Vacatures

source: Internships/Graduate programs
nl_nl: Stages/afstudeerplaatsen

source: Sponsorship opportunities
nl_nl: Sponsormogelijkheden

source: Photos
nl_nl: Foto's

source: Photos of activities of Cover.
nl_nl: Foto's van Coveractiviteiten.

source: Artificial Intelligence
nl_nl: Kunstmatige Intelligentie

source: Computing Science
nl_nl: Informatica

source: Student info
nl_nl: Info voor studenten

source: Exams & Summaries
nl_nl: Tentamens & Samenvattingen

source: Tools
nl_nl: Gereedschappen

source: These are tools available to you because you are a member of a committee.
nl_nl: Deze gereedschappen zijn beschikbaar voor jou omdat je in een commissie zit.

source: Webmail for Cover email accounts.
nl_nl: Webmail voor Cover emailaccounts

source: Manage your committee's mailing lists.
nl_nl: Beheer de mailinglijsten van jouw commissie.

source: Forms
nl_nl: Formulieren

source: Manage your committee's sign-up forms.
nl_nl: Beheer de inschrijfformulieren van jouw commissie.

source: Make a new content page on the website.
nl_nl: Maak een nieuwe pagina op de website.

source: People who signed up for Cover, but did not yet confirm their email address.
nl_nl: Mensen die zich hebben aangemeld voor Cover, maar hun emailadres nog niet hebben bevestigd.

source: Moderate calendar items.
nl_nl: Beheer agendapunten.

source: All active committee members according to the website.
nl_nl: Alle actieve commissieleden (volgens de website).

source: Manage a few of the website's settings.
nl_nl: Beheer een paar van de website instellingen.

source: I might go
nl_nl: Ik ga misschien

source: I'm going
nl_nl: Ik ben erbij

source: I'm not going
nl_nl: Ik ga niet

source: Attend
nl_nl: Neem deel

source: Calendar %d-%d
nl_nl: Agenda %d-%d

source: committee
nl_nl: commissie

source: working group
nl_nl: werkgroep

source: other
nl_nl: overig

source: (Unchanged)
nl_nl: (Onveranderd)

source: %d book
nl_nl: %d boek

source: %d photo
nl_nl: %d foto

source: Only people subscribed to this mailing list
nl_nl: Alleen mensen op de mailinglijst

source: Only *@svcover.nl addresses
nl_nl: Alleen *@svcover.nl adressen

source: Only the committee this list belongs to
nl_nl: Alleen de commissie van de lijst

source: Consumptions
nl_nl: Consumpties

source: Direct debits
nl_nl: Incasso's

source: To be processed
nl_nl: Nog niet verwerkt

source: Photo album with %s made on %s.
nl_nl: Fotoboek met %s gemaakt op %s.

source: You are connected to the Facebook profile of %s.
nl_nl: Je bent ingelogd als %s.

source: Your profile is no longer connected to your Facebook account.
nl_nl: Je bent niet langer gekoppeld aan Facebook.

source: Connect your Facebook account to see who of your friends are attending the activities.
nl_nl: Koppel Facebook om te zien wie van je vrienden naar activiteiten gaan.

source: Disconnect Facebook
nl_nl: Ontkoppel Facebook
